Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/rtc.h
/* -------- RTC_TMR : (RTC Offset: 0x58) (R/W 32) Tamper Mode register -------- */
#define RTC_TMR_EN0_Pos                       _U_(0)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN0_Msk                       (_U_(0x1) << RTC_TMR_EN0_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN0(value)                    (RTC_TMR_EN0_Msk & ((value) << RTC_TMR_EN0_Pos))    
#define   RTC_TMR_EN0_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN0_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN0_DISABLE                   (RTC_TMR_EN0_DISABLE_Val << RTC_TMR_EN0_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN0_ENABLE                    (RTC_TMR_EN0_ENABLE_Val << RTC_TMR_EN0_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_EN1_Pos                       _U_(1)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN1_Msk                       (_U_(0x1) << RTC_TMR_EN1_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN1(value)                    (RTC_TMR_EN1_Msk & ((value) << RTC_TMR_EN1_Pos))    
#define   RTC_TMR_EN1_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN1_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN1_DISABLE                   (RTC_TMR_EN1_DISABLE_Val << RTC_TMR_EN1_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN1_ENABLE                    (RTC_TMR_EN1_ENABLE_Val << RTC_TMR_EN1_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_EN2_Pos                       _U_(2)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN2_Msk                       (_U_(0x1) << RTC_TMR_EN2_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN2(value)                    (RTC_TMR_EN2_Msk & ((value) << RTC_TMR_EN2_Pos))    
#define   RTC_TMR_EN2_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN2_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN2_DISABLE                   (RTC_TMR_EN2_DISABLE_Val << RTC_TMR_EN2_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN2_ENABLE                    (RTC_TMR_EN2_ENABLE_Val << RTC_TMR_EN2_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_EN3_Pos                       _U_(3)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN3_Msk                       (_U_(0x1) << RTC_TMR_EN3_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN3(value)                    (RTC_TMR_EN3_Msk & ((value) << RTC_TMR_EN3_Pos))    
#define   RTC_TMR_EN3_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN3_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN3_DISABLE                   (RTC_TMR_EN3_DISABLE_Val << RTC_TMR_EN3_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN3_ENABLE                    (RTC_TMR_EN3_ENABLE_Val << RTC_TMR_EN3_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_EN4_Pos                       _U_(4)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN4_Msk                       (_U_(0x1) << RTC_TMR_EN4_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN4(value)                    (RTC_TMR_EN4_Msk & ((value) << RTC_TMR_EN4_Pos))    
#define   RTC_TMR_EN4_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN4_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN4_DISABLE                   (RTC_TMR_EN4_DISABLE_Val << RTC_TMR_EN4_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN4_ENABLE                    (RTC_TMR_EN4_ENABLE_Val << RTC_TMR_EN4_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_EN5_Pos                       _U_(5)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN5_Msk                       (_U_(0x1) << RTC_TMR_EN5_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN5(value)                    (RTC_TMR_EN5_Msk & ((value) << RTC_TMR_EN5_Pos))    
#define   RTC_TMR_EN5_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN5_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN5_DISABLE                   (RTC_TMR_EN5_DISABLE_Val << RTC_TMR_EN5_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN5_ENABLE                    (RTC_TMR_EN5_ENABLE_Val << RTC_TMR_EN5_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_EN6_Pos                       _U_(6)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN6_Msk                       (_U_(0x1) << RTC_TMR_EN6_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN6(value)                    (RTC_TMR_EN6_Msk & ((value) << RTC_TMR_EN6_Pos))    
#define   RTC_TMR_EN6_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN6_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN6_DISABLE                   (RTC_TMR_EN6_DISABLE_Val << RTC_TMR_EN6_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN6_ENABLE                    (RTC_TMR_EN6_ENABLE_Val << RTC_TMR_EN6_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_EN7_Pos                       _U_(7)                                               /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Position */
#define RTC_TMR_EN7_Msk                       (_U_(0x1) << RTC_TMR_EN7_Pos)                        /**< (RTC_TMR) WKUPx+1 Tamper Source Enable Mask */
#define RTC_TMR_EN7(value)                    (RTC_TMR_EN7_Msk & ((value) << RTC_TMR_EN7_Pos))    
#define   RTC_TMR_EN7_DISABLE_Val             _U_(0x0)                                             /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper.  */
#define   RTC_TMR_EN7_ENABLE_Val              _U_(0x1)                                             /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper.  */
#define RTC_TMR_EN7_DISABLE                   (RTC_TMR_EN7_DISABLE_Val << RTC_TMR_EN7_Pos)         /**< (RTC_TMR) WKUP pin index x+1 is not enabled as a source of tamper. Position  */
#define RTC_TMR_EN7_ENABLE                    (RTC_TMR_EN7_ENABLE_Val << RTC_TMR_EN7_Pos)          /**< (RTC_TMR) WKUP pin index x+1 is enabled as a source of tamper. Position  */
#define RTC_TMR_TRLOCK_Pos                    _U_(15)                                              /**< (RTC_TMR) Tamper Registers Lock (Write-once, cleared by VDDCORE reset) Position */
#define RTC_TMR_TRLOCK_Msk                    (_U_(0x1) << RTC_TMR_TRLOCK_Pos)                     /**< (RTC_TMR) Tamper Registers Lock (Write-once, cleared by VDDCORE reset) Mask */
#define RTC_TMR_TRLOCK(value)                 (RTC_TMR_TRLOCK_Msk & ((value) << RTC_TMR_TRLOCK_Pos))
#define   RTC_TMR_TRLOCK_UNLOCKED_Val         _U_(0x0)                                             /**< (RTC_TMR) RTC_TMR and RTC_TDPR can be written.  */
#define   RTC_TMR_TRLOCK_LOCKED_Val           _U_(0x1)                                             /**< (RTC_TMR) RTC_TMR and RTC_TDPR cannot be written until the next VDDCORE domain reset.  */
#define RTC_TMR_TRLOCK_UNLOCKED               (RTC_TMR_TRLOCK_UNLOCKED_Val << RTC_TMR_TRLOCK_Pos)  /**< (RTC_TMR) RTC_TMR and RTC_TDPR can be written. Position  */
#define RTC_TMR_TRLOCK_LOCKED                 (RTC_TMR_TRLOCK_LOCKED_Val << RTC_TMR_TRLOCK_Pos)    /**< (RTC_TMR) RTC_TMR and RTC_TDPR cannot be written until the next VDDCORE domain reset. Position  */
#define RTC_TMR_POL0_Pos                      _U_(16)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL0_Msk                      (_U_(0x1) << RTC_TMR_POL0_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL0(value)                   (RTC_TMR_POL0_Msk & ((value) << RTC_TMR_POL0_Pos))  
#define   RTC_TMR_POL0_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL0_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL0_LOW                      (RTC_TMR_POL0_LOW_Val << RTC_TMR_POL0_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL0_HIGH                     (RTC_TMR_POL0_HIGH_Val << RTC_TMR_POL0_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL1_Pos                      _U_(17)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL1_Msk                      (_U_(0x1) << RTC_TMR_POL1_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL1(value)                   (RTC_TMR_POL1_Msk & ((value) << RTC_TMR_POL1_Pos))  
#define   RTC_TMR_POL1_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL1_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL1_LOW                      (RTC_TMR_POL1_LOW_Val << RTC_TMR_POL1_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL1_HIGH                     (RTC_TMR_POL1_HIGH_Val << RTC_TMR_POL1_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL2_Pos                      _U_(18)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL2_Msk                      (_U_(0x1) << RTC_TMR_POL2_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL2(value)                   (RTC_TMR_POL2_Msk & ((value) << RTC_TMR_POL2_Pos))  
#define   RTC_TMR_POL2_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL2_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL2_LOW                      (RTC_TMR_POL2_LOW_Val << RTC_TMR_POL2_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL2_HIGH                     (RTC_TMR_POL2_HIGH_Val << RTC_TMR_POL2_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL3_Pos                      _U_(19)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL3_Msk                      (_U_(0x1) << RTC_TMR_POL3_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL3(value)                   (RTC_TMR_POL3_Msk & ((value) << RTC_TMR_POL3_Pos))  
#define   RTC_TMR_POL3_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL3_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL3_LOW                      (RTC_TMR_POL3_LOW_Val << RTC_TMR_POL3_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL3_HIGH                     (RTC_TMR_POL3_HIGH_Val << RTC_TMR_POL3_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL4_Pos                      _U_(20)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL4_Msk                      (_U_(0x1) << RTC_TMR_POL4_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL4(value)                   (RTC_TMR_POL4_Msk & ((value) << RTC_TMR_POL4_Pos))  
#define   RTC_TMR_POL4_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL4_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL4_LOW                      (RTC_TMR_POL4_LOW_Val << RTC_TMR_POL4_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL4_HIGH                     (RTC_TMR_POL4_HIGH_Val << RTC_TMR_POL4_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL5_Pos                      _U_(21)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL5_Msk                      (_U_(0x1) << RTC_TMR_POL5_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL5(value)                   (RTC_TMR_POL5_Msk & ((value) << RTC_TMR_POL5_Pos))  
#define   RTC_TMR_POL5_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL5_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL5_LOW                      (RTC_TMR_POL5_LOW_Val << RTC_TMR_POL5_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL5_HIGH                     (RTC_TMR_POL5_HIGH_Val << RTC_TMR_POL5_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL6_Pos                      _U_(22)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL6_Msk                      (_U_(0x1) << RTC_TMR_POL6_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL6(value)                   (RTC_TMR_POL6_Msk & ((value) << RTC_TMR_POL6_Pos))  
#define   RTC_TMR_POL6_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL6_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL6_LOW                      (RTC_TMR_POL6_LOW_Val << RTC_TMR_POL6_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL6_HIGH                     (RTC_TMR_POL6_HIGH_Val << RTC_TMR_POL6_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL7_Pos                      _U_(23)                                              /**< (RTC_TMR) WKUPx+1 Polarity Position */
#define RTC_TMR_POL7_Msk                      (_U_(0x1) << RTC_TMR_POL7_Pos)                       /**< (RTC_TMR) WKUPx+1 Polarity Mask */
#define RTC_TMR_POL7(value)                   (RTC_TMR_POL7_Msk & ((value) << RTC_TMR_POL7_Pos))  
#define   RTC_TMR_POL7_LOW_Val                _U_(0x0)                                             /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated.  */
#define   RTC_TMR_POL7_HIGH_Val               _U_(0x1)                                             /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated.  */
#define RTC_TMR_POL7_LOW                      (RTC_TMR_POL7_LOW_Val << RTC_TMR_POL7_Pos)           /**< (RTC_TMR) If the source of tamper remains low for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_POL7_HIGH                     (RTC_TMR_POL7_HIGH_Val << RTC_TMR_POL7_Pos)          /**< (RTC_TMR) If the source of tamper remains high for a debounce period, a tamper event is generated. Position  */
#define RTC_TMR_Msk                           _U_(0x00FF80FF)                                      /**< (RTC_TMR) Register Mask  */

#define RTC_TMR_EN_Pos                        _U_(0)                                               /**< (RTC_TMR Position) WKUPx+x Tamper Source Enable */
#define RTC_TMR_EN_Msk                        (_U_(0xFF) << RTC_TMR_EN_Pos)                        /**< (RTC_TMR Mask) EN */
#define RTC_TMR_EN(value)                     (RTC_TMR_EN_Msk & ((value) << RTC_TMR_EN_Pos))       
#define RTC_TMR_POL_Pos                       _U_(16)                                              /**< (RTC_TMR Position) WKUPx+x Polarity */
#define RTC_TMR_POL_Msk                       (_U_(0xFF) << RTC_TMR_POL_Pos)                       /**< (RTC_TMR Mask) POL */
#define RTC_TMR_POL(value)                    (RTC_TMR_POL_Msk & ((value) << RTC_TMR_POL_Pos))     

