Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/rtc.h
/* -------- RTC_TDPR : (RTC Offset: 0x5C) (R/W 32) Tamper Debounce Period register -------- */
#define RTC_TDPR_PERA_Pos                     _U_(0)                                               /**< (RTC_TDPR) Debounce Period A Position */
#define RTC_TDPR_PERA_Msk                     (_U_(0xF) << RTC_TDPR_PERA_Pos)                      /**< (RTC_TDPR) Debounce Period A Mask */
#define RTC_TDPR_PERA(value)                  (RTC_TDPR_PERA_Msk & ((value) << RTC_TDPR_PERA_Pos))
#define   RTC_TDPR_PERA_MD_SCLK_2_Val         _U_(0x0)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 2 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERA_MD_SCLK_4_Val         _U_(0x1)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 4 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERA_MD_SCLK_8_Val         _U_(0x2)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 8 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERA_MD_SCLK_16_Val        _U_(0x3)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 16 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERA_MD_SCLK_32_Val        _U_(0x4)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 32 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERA_MD_SCLK_64_Val        _U_(0x5)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 64 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERA_MD_SCLK_128_Val       _U_(0x6)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 128 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERA_MD_SCLK_256_Val       _U_(0x7)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 256 monitoring-domain slow clock cycles to generate a tamper event.  */
#define RTC_TDPR_PERA_MD_SCLK_2               (RTC_TDPR_PERA_MD_SCLK_2_Val << RTC_TDPR_PERA_Pos)   /**< (RTC_TDPR) The source of tamper must remain active for at least 2 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERA_MD_SCLK_4               (RTC_TDPR_PERA_MD_SCLK_4_Val << RTC_TDPR_PERA_Pos)   /**< (RTC_TDPR) The source of tamper must remain active for at least 4 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERA_MD_SCLK_8               (RTC_TDPR_PERA_MD_SCLK_8_Val << RTC_TDPR_PERA_Pos)   /**< (RTC_TDPR) The source of tamper must remain active for at least 8 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERA_MD_SCLK_16              (RTC_TDPR_PERA_MD_SCLK_16_Val << RTC_TDPR_PERA_Pos)  /**< (RTC_TDPR) The source of tamper must remain active for at least 16 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERA_MD_SCLK_32              (RTC_TDPR_PERA_MD_SCLK_32_Val << RTC_TDPR_PERA_Pos)  /**< (RTC_TDPR) The source of tamper must remain active for at least 32 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERA_MD_SCLK_64              (RTC_TDPR_PERA_MD_SCLK_64_Val << RTC_TDPR_PERA_Pos)  /**< (RTC_TDPR) The source of tamper must remain active for at least 64 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERA_MD_SCLK_128             (RTC_TDPR_PERA_MD_SCLK_128_Val << RTC_TDPR_PERA_Pos) /**< (RTC_TDPR) The source of tamper must remain active for at least 128 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERA_MD_SCLK_256             (RTC_TDPR_PERA_MD_SCLK_256_Val << RTC_TDPR_PERA_Pos) /**< (RTC_TDPR) The source of tamper must remain active for at least 256 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_Pos                     _U_(4)                                               /**< (RTC_TDPR) Debounce Period B Position */
#define RTC_TDPR_PERB_Msk                     (_U_(0xF) << RTC_TDPR_PERB_Pos)                      /**< (RTC_TDPR) Debounce Period B Mask */
#define RTC_TDPR_PERB(value)                  (RTC_TDPR_PERB_Msk & ((value) << RTC_TDPR_PERB_Pos))
#define   RTC_TDPR_PERB_MD_SCLK_2_Val         _U_(0x0)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 2 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERB_MD_SCLK_4_Val         _U_(0x1)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 4 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERB_MD_SCLK_8_Val         _U_(0x2)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 8 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERB_MD_SCLK_16_Val        _U_(0x3)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 16 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERB_MD_SCLK_32_Val        _U_(0x4)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 32 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERB_MD_SCLK_64_Val        _U_(0x5)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 64 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERB_MD_SCLK_128_Val       _U_(0x6)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 128 monitoring-domain slow clock cycles to generate a tamper event.  */
#define   RTC_TDPR_PERB_MD_SCLK_256_Val       _U_(0x7)                                             /**< (RTC_TDPR) The source of tamper must remain active for at least 256 monitoring-domain slow clock cycles to generate a tamper event.  */
#define RTC_TDPR_PERB_MD_SCLK_2               (RTC_TDPR_PERB_MD_SCLK_2_Val << RTC_TDPR_PERB_Pos)   /**< (RTC_TDPR) The source of tamper must remain active for at least 2 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_MD_SCLK_4               (RTC_TDPR_PERB_MD_SCLK_4_Val << RTC_TDPR_PERB_Pos)   /**< (RTC_TDPR) The source of tamper must remain active for at least 4 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_MD_SCLK_8               (RTC_TDPR_PERB_MD_SCLK_8_Val << RTC_TDPR_PERB_Pos)   /**< (RTC_TDPR) The source of tamper must remain active for at least 8 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_MD_SCLK_16              (RTC_TDPR_PERB_MD_SCLK_16_Val << RTC_TDPR_PERB_Pos)  /**< (RTC_TDPR) The source of tamper must remain active for at least 16 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_MD_SCLK_32              (RTC_TDPR_PERB_MD_SCLK_32_Val << RTC_TDPR_PERB_Pos)  /**< (RTC_TDPR) The source of tamper must remain active for at least 32 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_MD_SCLK_64              (RTC_TDPR_PERB_MD_SCLK_64_Val << RTC_TDPR_PERB_Pos)  /**< (RTC_TDPR) The source of tamper must remain active for at least 64 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_MD_SCLK_128             (RTC_TDPR_PERB_MD_SCLK_128_Val << RTC_TDPR_PERB_Pos) /**< (RTC_TDPR) The source of tamper must remain active for at least 128 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_PERB_MD_SCLK_256             (RTC_TDPR_PERB_MD_SCLK_256_Val << RTC_TDPR_PERB_Pos) /**< (RTC_TDPR) The source of tamper must remain active for at least 256 monitoring-domain slow clock cycles to generate a tamper event. Position  */
#define RTC_TDPR_SELP0_Pos                    _U_(16)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP0_Msk                    (_U_(0x1) << RTC_TDPR_SELP0_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP0(value)                 (RTC_TDPR_SELP0_Msk & ((value) << RTC_TDPR_SELP0_Pos))
#define   RTC_TDPR_SELP0_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP0_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP0_SEL_PA                 (RTC_TDPR_SELP0_SEL_PA_Val << RTC_TDPR_SELP0_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP0_SEL_PB                 (RTC_TDPR_SELP0_SEL_PB_Val << RTC_TDPR_SELP0_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_SELP1_Pos                    _U_(17)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP1_Msk                    (_U_(0x1) << RTC_TDPR_SELP1_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP1(value)                 (RTC_TDPR_SELP1_Msk & ((value) << RTC_TDPR_SELP1_Pos))
#define   RTC_TDPR_SELP1_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP1_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP1_SEL_PA                 (RTC_TDPR_SELP1_SEL_PA_Val << RTC_TDPR_SELP1_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP1_SEL_PB                 (RTC_TDPR_SELP1_SEL_PB_Val << RTC_TDPR_SELP1_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_SELP2_Pos                    _U_(18)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP2_Msk                    (_U_(0x1) << RTC_TDPR_SELP2_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP2(value)                 (RTC_TDPR_SELP2_Msk & ((value) << RTC_TDPR_SELP2_Pos))
#define   RTC_TDPR_SELP2_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP2_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP2_SEL_PA                 (RTC_TDPR_SELP2_SEL_PA_Val << RTC_TDPR_SELP2_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP2_SEL_PB                 (RTC_TDPR_SELP2_SEL_PB_Val << RTC_TDPR_SELP2_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_SELP3_Pos                    _U_(19)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP3_Msk                    (_U_(0x1) << RTC_TDPR_SELP3_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP3(value)                 (RTC_TDPR_SELP3_Msk & ((value) << RTC_TDPR_SELP3_Pos))
#define   RTC_TDPR_SELP3_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP3_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP3_SEL_PA                 (RTC_TDPR_SELP3_SEL_PA_Val << RTC_TDPR_SELP3_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP3_SEL_PB                 (RTC_TDPR_SELP3_SEL_PB_Val << RTC_TDPR_SELP3_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_SELP4_Pos                    _U_(20)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP4_Msk                    (_U_(0x1) << RTC_TDPR_SELP4_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP4(value)                 (RTC_TDPR_SELP4_Msk & ((value) << RTC_TDPR_SELP4_Pos))
#define   RTC_TDPR_SELP4_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP4_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP4_SEL_PA                 (RTC_TDPR_SELP4_SEL_PA_Val << RTC_TDPR_SELP4_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP4_SEL_PB                 (RTC_TDPR_SELP4_SEL_PB_Val << RTC_TDPR_SELP4_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_SELP5_Pos                    _U_(21)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP5_Msk                    (_U_(0x1) << RTC_TDPR_SELP5_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP5(value)                 (RTC_TDPR_SELP5_Msk & ((value) << RTC_TDPR_SELP5_Pos))
#define   RTC_TDPR_SELP5_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP5_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP5_SEL_PA                 (RTC_TDPR_SELP5_SEL_PA_Val << RTC_TDPR_SELP5_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP5_SEL_PB                 (RTC_TDPR_SELP5_SEL_PB_Val << RTC_TDPR_SELP5_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_SELP6_Pos                    _U_(22)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP6_Msk                    (_U_(0x1) << RTC_TDPR_SELP6_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP6(value)                 (RTC_TDPR_SELP6_Msk & ((value) << RTC_TDPR_SELP6_Pos))
#define   RTC_TDPR_SELP6_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP6_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP6_SEL_PA                 (RTC_TDPR_SELP6_SEL_PA_Val << RTC_TDPR_SELP6_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP6_SEL_PB                 (RTC_TDPR_SELP6_SEL_PB_Val << RTC_TDPR_SELP6_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_SELP7_Pos                    _U_(23)                                              /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Position */
#define RTC_TDPR_SELP7_Msk                    (_U_(0x1) << RTC_TDPR_SELP7_Pos)                     /**< (RTC_TDPR) WKUPx+1 Debounce Period Selection Mask */
#define RTC_TDPR_SELP7(value)                 (RTC_TDPR_SELP7_Msk & ((value) << RTC_TDPR_SELP7_Pos))
#define   RTC_TDPR_SELP7_SEL_PA_Val           _U_(0x0)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period.  */
#define   RTC_TDPR_SELP7_SEL_PB_Val           _U_(0x1)                                             /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period.  */
#define RTC_TDPR_SELP7_SEL_PA                 (RTC_TDPR_SELP7_SEL_PA_Val << RTC_TDPR_SELP7_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERA period. Position  */
#define RTC_TDPR_SELP7_SEL_PB                 (RTC_TDPR_SELP7_SEL_PB_Val << RTC_TDPR_SELP7_Pos)    /**< (RTC_TDPR) WKUP pin index x+1 is debounced with PERB period. Position  */
#define RTC_TDPR_Msk                          _U_(0x00FF00FF)                                      /**< (RTC_TDPR) Register Mask  */

#define RTC_TDPR_SELP_Pos                     _U_(16)                                              /**< (RTC_TDPR Position) WKUPx+x Debounce Period Selection */
#define RTC_TDPR_SELP_Msk                     (_U_(0xFF) << RTC_TDPR_SELP_Pos)                     /**< (RTC_TDPR Mask) SELP */
#define RTC_TDPR_SELP(value)                  (RTC_TDPR_SELP_Msk & ((value) << RTC_TDPR_SELP_Pos)) 

/* -------- RTC_VERSION : (RTC Offset: 0xFC) ( R/ 32) Version Register -------- */
#define RTC_VERSION_VERSION_Pos               _U_(0)                                               /**< (RTC_VERSION) Version of the Hardware Module Position */
#define RTC_VERSION_VERSION_Msk               (_U_(0xFFF) << RTC_VERSION_VERSION_Pos)              /**< (RTC_VERSION) Version of the Hardware Module Mask */
#define RTC_VERSION_VERSION(value)            (RTC_VERSION_VERSION_Msk & ((value) << RTC_VERSION_VERSION_Pos))
#define RTC_VERSION_MFN_Pos                   _U_(16)                                              /**< (RTC_VERSION) Metal Fix Number Position */
#define RTC_VERSION_MFN_Msk                   (_U_(0x7) << RTC_VERSION_MFN_Pos)                    /**< (RTC_VERSION) Metal Fix Number Mask */
#define RTC_VERSION_MFN(value)                (RTC_VERSION_MFN_Msk & ((value) << RTC_VERSION_MFN_Pos))
#define RTC_VERSION_Msk                       _U_(0x00070FFF)                                      /**< (RTC_VERSION) Register Mask  */


/** \brief RTC register offsets definitions */
#define RTC_TSTR_REG_OFST              (0x00)              /**< (RTC_TSTR) TimeStamp Time Register 0 Offset */
#define RTC_TSDR_REG_OFST              (0x04)              /**< (RTC_TSDR) TimeStamp Date Register 0 Offset */
#define RTC_TSSR_REG_OFST              (0x08)              /**< (RTC_TSSR) TimeStamp Source Register 0 Offset */
#define RTC_CR_REG_OFST                (0x00)              /**< (RTC_CR) Control Register Offset */
#define RTC_MR_REG_OFST                (0x04)              /**< (RTC_MR) Mode Register Offset */
#define RTC_TIMR_REG_OFST              (0x08)              /**< (RTC_TIMR) Time Register Offset */
#define RTC_CALR_REG_OFST              (0x0C)              /**< (RTC_CALR) Calendar Register Offset */
#define RTC_TIMALR_REG_OFST            (0x10)              /**< (RTC_TIMALR) Time Alarm Register Offset */
#define RTC_CALALR_REG_OFST            (0x14)              /**< (RTC_CALALR) Calendar Alarm Register Offset */
#define RTC_SR_REG_OFST                (0x18)              /**< (RTC_SR) Status Register Offset */
#define RTC_SCCR_REG_OFST              (0x1C)              /**< (RTC_SCCR) Status Clear Command Register Offset */
#define RTC_IER_REG_OFST               (0x20)              /**< (RTC_IER) Interrupt Enable Register Offset */
#define RTC_IDR_REG_OFST               (0x24)              /**< (RTC_IDR) Interrupt Disable Register Offset */
#define RTC_IMR_REG_OFST               (0x28)              /**< (RTC_IMR) Interrupt Mask Register Offset */
#define RTC_VER_REG_OFST               (0x2C)              /**< (RTC_VER) Valid Entry Register Offset */
#define RTC_TMR_REG_OFST               (0x58)              /**< (RTC_TMR) Tamper Mode register Offset */
#define RTC_TDPR_REG_OFST              (0x5C)              /**< (RTC_TDPR) Tamper Debounce Period register Offset */
#define RTC_VERSION_REG_OFST           (0xFC)              /**< (RTC_VERSION) Version Register Offset */

